## Statistics_4

### Problem Statement 1:

Is gender independent of education level? A random sample of 395 people were
surveyed and each person was asked to report the highest education level they
obtained. The data that resulted from the survey is summarized in the following table:

        High_School  Bachelors  Masters  Ph.d.  Total
Female      60          54         46     41     201

Male        40          44         53     57     194

Total       100         98         99     98     395

Question: 

Are gender and education level dependent at 5% level of significance?  

In other words, given the data collected above, is there a relationship between the gender of an individual and the level of education that they have obtained?

In [1]:
import numpy as np
import pandas as pd
import scipy.stats as stats
male=[40,44,53,57]
female=[60,54,46,41]
high_school=[60,40]
bachelors=[54,44]
masters=[46,53]
phd=[41,57]
marks=male+female
print(marks)
sex=['M','M','M','M','F','F','F','F']
education=['high_school','bachelors','masters','phd','high_school','bachelors','masters','phd']
df=pd.DataFrame({"Education":education,"Marks":marks,"Sex":sex})
df
print(df)

[40, 44, 53, 57, 60, 54, 46, 41]
     Education  Marks Sex
0  high_school     40   M
1    bachelors     44   M
2      masters     53   M
3          phd     57   M
4  high_school     60   F
5    bachelors     54   F
6      masters     46   F
7          phd     41   F

In [7]:
cross_tab=pd.crosstab([df.Sex,df.Marks],df.Education,margins=True)
cross_tab

Education  bachelors  high_school  masters  phd  All
Sex Marks
F   41             0            0        0    1    1
    46             0            0        1    0    1
    54             1            0        0    0    1
    60             0            1        0    0    1
M   40             0            1        0    0    1
    44             1            0        0    0    1
    53             0            0        1    0    1
    57             0            0        0    1    1
All                2            2        2    2    8

In [9]:
df1=pd.crosstab(df.Sex,df.Education,df.Marks,aggfunc="sum",margins=True)
df1

Education  bachelors  high_school  masters  phd  All
Sex
F                 54           60       46   41  201
M                 44           40       53   57  194
All               98          100       99   98  395

In [10]:
df1.columns=["bachelors","high_school","masters","phd","genderwise_total"]
df1.index=["female","male","combined"]
df1

          bachelors  high_school  masters  phd  genderwise_total
female           54           60       46   41               201
male             44           40       53   57               194
combined         98          100       99   98               395

In [11]:
df2=df1.iloc[0:2,0:4]
df2

        bachelors  high_school  masters  phd
female         54           60       46   41
male           44           40       53   57

In [12]:
df3=np.outer(df1["genderwise_total"][0:2],df1.loc["combined"][0:4])/395.0
df3=pd.DataFrame(df3)
df3.columns=["bachelors","high_school","masters","phd"]
df3.index=["female","male"]
df3

        bachelors  high_school    masters        phd
female  49.868354    50.886076  50.377215  49.868354
male    48.131646    49.113924  48.622785  48.131646

In [13]:
chi_squared_stat=(((df3-df2)**2)/df3).sum().sum()
print(chi_squared_stat)

8.006066246262538

In [14]:
cvalue=stats.chi2.ppf(q=0.95,df=3)
print("critical value")
print(cvalue)

critical value
7.814727903251179

In [15]:
p_value=1-stats.chi2.cdf(x=chi_squared_stat,df=3)
print("p value")
print(p_value)

p value
0.04588650089174717

In [17]:
result=stats.chi2_contingency(observed=df2)
print(result)

(8.006066246262538, 0.045886500891747214, 3, array([[49.86835443, 50.88607595, 50.37721519, 49.86835443],
       [48.13164557, 49.11392405, 48.62278481, 48.13164557]]))

### Problem Statement 2:

Using the following data, perform a oneway analysis of variance using α=.05. Write
up the results in APA format.

[Group1: 51, 45, 33, 45, 67]

[Group2: 23, 43, 23, 43, 45]

[Group3: 56, 76, 74, 87, 56]

In [19]:
import scipy.stats as stats
group1=[51,45,33,45,67]
group2=[23,43,23,43,45]
group3=[56,76,74,87,56]
statistic, pvalue=stats.f_oneway(group1,group2,group3)
print("p statistic value {} , p value {}".format(statistic,pvalue))
if pvalue < 0.05:
    print('True')
else:
    print('False')

p statistic value 9.747205503009463 , p value 0.0030597541434430556
True

### Problem Statement 3:

Calculate F Test for given 10, 20, 30, 40, 50 and 5,10,15, 20, 25.
For 10, 20, 30, 40, 50:

In [22]:
stats.f_oneway([10, 20, 30, 40, 50],[5,10,15,20,25])

group1=[10, 20, 30, 40, 50]
group2=[5,10,15,20,25]
mean_1=np.mean(group1)
mean_2=np.mean(group2)
grp1_sub_mean1=[]
grp2_sub_mean2=[]
add1=0
add2=0
for items in group1:
    add1 +=(items - mean_1)**2
for items in group2:
    add2 +=(items - mean_2)**2
var1=add1/(len(group1)-1)
var2=add2/(len(group2)-1)

F_Test=var1/var2
print("F_Test for given 10, 20, 30, 40, 50 and 5,10,15, 20, 25 is:",F_Test)

F_Test for given 10, 20, 30, 40, 50 and 5,10,15, 20, 25 is: 4.0